#### Terraform Plan Output 

```
data.archive_file.attacker_zip: Reading...
random_string.public_id: Refreshing state... [id=8p8ia2]
random_string.secure_id: Refreshing state... [id=9r3207]
random_string.rand_id: Refreshing state... [id=mpn9cb]
random_string.legacy_id: Refreshing state... [id=vhvg8z]
random_string.dev_id: Refreshing state... [id=vzt27m]
data.archive_file.attacker_zip: Read complete after 0s [id=e2074b6c46b0a6e5a1edcf7b0b1a29715f3ae265]
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=54a50d1b1f876946b9920788fd555f07af832687]
aws_iam_role.scanner: Refreshing state... [id=S3ScannerRole]
aws_iam_role.attacker_role: Refreshing state... [id=S3RedTeamRole]
aws_s3_bucket.legacy_data: Refreshing state... [id=cyb611-legacy-archive-vhvg8z]
aws_s3_bucket.insecure_bucket2: Refreshing state... [id=cyb611-secure-phish-bits-public-rw]
aws_s3_bucket.public_logs: Refreshing state... [id=cyb611-web-logs-8p8ia2]
aws_s3_bucket.public_assets: Refreshing state... [id=cyb611-website-assets-8p8ia2]
aws_s3_bucket.insecure_bucket1: Refreshing state... [id=cyb611-secure-phish-bits-no-encryption]
aws_s3_bucket.secure_bucket: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket.dev_bucket: Refreshing state... [id=cyb611-dev-scratchpad-vzt27m]
aws_s3_bucket.log_bucket: Refreshing state... [id=cyb611-access-logs-phish-bits-12345]
aws_s3_bucket.trail_bucket: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_s3_bucket.secure_storage: Refreshing state... [id=cyb611-finance-backup-9r3207]
data.aws_caller_identity.current: Reading...
aws_s3_bucket.main_bucket: Refreshing state... [id=cyb611-marketing-assets-mpn9cb]
data.aws_caller_identity.current: Read complete after 0s [id=151462990345]
aws_s3_bucket.legacy_logs: Refreshing state... [id=cyb611-archive-logs-vhvg8z]
aws_s3_bucket.access_logs: Refreshing state... [id=cyb611-internal-logs-9r3207]
aws_iam_role_policy.scanner: Refreshing state... [id=S3ScannerRole:S3ScannerPolicy]
aws_lambda_function.scanner: Refreshing state... [id=S3SecurityScanner]
aws_iam_role_policy.attacker_policy: Refreshing state... [id=S3RedTeamRole:S3RedTeamPolicy]
aws_lambda_function.attacker_lambda: Refreshing state... [id=S3RedTeamScanner]
aws_s3_bucket_ownership_controls.dev_ownership: Refreshing state... [id=cyb611-dev-scratchpad-vzt27m]
aws_s3_bucket_versioning.dev_versioning: Refreshing state... [id=cyb611-dev-scratchpad-vzt27m]
aws_s3_object.initial_config: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_versioning.legacy_versioning: Refreshing state... [id=cyb611-legacy-archive-vhvg8z]
aws_s3_object.archive_file: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_public_access_block.legacy_block: Refreshing state... [id=cyb611-legacy-archive-vhvg8z]
aws_s3_bucket_ownership_controls.legacy_ownership: Refreshing state... [id=cyb611-legacy-archive-vhvg8z]
aws_s3_bucket_ownership_controls.public_log_ownership: Refreshing state... [id=cyb611-web-logs-8p8ia2]
aws_s3_bucket_server_side_encryption_configuration.public_enc: Refreshing state... [id=cyb611-website-assets-8p8ia2]
aws_s3_bucket_versioning.public_versioning: Refreshing state... [id=cyb611-website-assets-8p8ia2]
aws_s3_bucket_policy.enforce_tls_public: Refreshing state... [id=cyb611-website-assets-8p8ia2]
aws_s3_bucket_public_access_block.public_block: Refreshing state... [id=cyb611-website-assets-8p8ia2]
aws_s3_bucket_logging.public_logging_config: Refreshing state... [id=cyb611-website-assets-8p8ia2]
aws_s3_bucket_ownership_controls.public_ownership: Refreshing state... [id=cyb611-website-assets-8p8ia2]
aws_s3_bucket_acl.dev_acl: Refreshing state... [id=cyb611-dev-scratchpad-vzt27m,private]
aws_lambda_function_url.attacker_url: Refreshing state... [id=S3RedTeamScanner]
aws_lambda_function_url.scanner: Refreshing state... [id=S3SecurityScanner]
aws_s3_bucket_policy.trail_bucket_policy: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_cloudtrail.main_trail: Refreshing state... [id=arn:aws:cloudtrail:us-east-2:151462990345:trail/cyb611-management-events-trail]
aws_s3_bucket_policy.enforce_ssl: Refreshing state... [id=cyb611-finance-backup-9r3207]
aws_s3_bucket_ownership_controls.secure_ownership: Refreshing state... [id=cyb611-finance-backup-9r3207]
aws_s3_object.sample_record: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_server_side_encryption_configuration.default_enc: Refreshing state... [id=cyb611-finance-backup-9r3207]
aws_s3_bucket_versioning.secure_versioning: Refreshing state... [id=cyb611-finance-backup-9r3207]
aws_s3_bucket_public_access_block.block_public: Refreshing state... [id=cyb611-finance-backup-9r3207]
aws_s3_bucket_cors_configuration.cors_config: Refreshing state... [id=cyb611-marketing-assets-mpn9cb]
aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=cyb611-marketing-assets-mpn9cb]
aws_s3_bucket_public_access_block.log_block: Refreshing state... [id=cyb611-archive-logs-vhvg8z]
aws_s3_bucket_ownership_controls.legacy_log_ownership: Refreshing state... [id=cyb611-archive-logs-vhvg8z]
aws_s3_bucket_policy.public_rw_policy: Refreshing state... [id=cyb611-website-assets-8p8ia2]
aws_s3_bucket_acl.public_log_acl: Refreshing state... [id=cyb611-web-logs-8p8ia2,log-delivery-write]
aws_s3_bucket_logging.log_config: Refreshing state... [id=cyb611-finance-backup-9r3207]
aws_s3_bucket_policy.read_policy: Refreshing state... [id=cyb611-marketing-assets-mpn9cb]
aws_s3_object.web_asset: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_object.dataset_upload: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_acl.legacy_log_acl: Refreshing state... [id=cyb611-archive-logs-vhvg8z,log-delivery-write]
aws_s3_bucket_logging.legacy_logging_config: Refreshing state... [id=cyb611-legacy-archive-vhvg8z]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.access_logs must be replaced
-/+ resource "aws_s3_bucket" "access_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-internal-logs-9r3207" -> (known after apply)
      ~ bucket                      = "cyb611-internal-logs-9r3207" -> "cyb611-Secure-logs-9r3207" # forces replacement
      ~ bucket_domain_name          = "cyb611-internal-logs-9r3207.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-internal-logs-9r3207.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-internal-logs-9r3207" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket.dev_bucket must be replaced
-/+ resource "aws_s3_bucket" "dev_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-dev-scratchpad-vzt27m" -> (known after apply)
      ~ bucket                      = "cyb611-dev-scratchpad-vzt27m" -> "cyb611-Insecure-iam-vzt27m" # forces replacement
      ~ bucket_domain_name          = "cyb611-dev-scratchpad-vzt27m.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-dev-scratchpad-vzt27m.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-dev-scratchpad-vzt27m" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          - "Environment" = "Development" -> null
          ~ "Name"        = "Dev Scratchpad" -> "Insecure IAM"
        }
      ~ tags_all                    = {
          - "Environment" = "Development" -> null
          ~ "Name"        = "Dev Scratchpad" -> "Insecure IAM"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket.legacy_data must be replaced
-/+ resource "aws_s3_bucket" "legacy_data" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-legacy-archive-vhvg8z" -> (known after apply)
      ~ bucket                      = "cyb611-legacy-archive-vhvg8z" -> "cyb611-Insecure-no-encryption-vhvg8z" # forces replacement
      ~ bucket_domain_name          = "cyb611-legacy-archive-vhvg8z.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-legacy-archive-vhvg8z.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-legacy-archive-vhvg8z" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          - "Environment" = "Staging" -> null
          ~ "Name"        = "Legacy Archive" -> "Insecure No Encryption"
        }
      ~ tags_all                    = {
          - "Environment" = "Staging" -> null
          ~ "Name"        = "Legacy Archive" -> "Insecure No Encryption"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)
      - logging {
          - target_bucket = "cyb611-archive-logs-vhvg8z" -> null
          - target_prefix = "log/" -> null
        }

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket.legacy_logs must be replaced
-/+ resource "aws_s3_bucket" "legacy_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-archive-logs-vhvg8z" -> (known after apply)
      ~ bucket                      = "cyb611-archive-logs-vhvg8z" -> "cyb611-Insecure-no-encryption-logs-vhvg8z" # forces replacement
      ~ bucket_domain_name          = "cyb611-archive-logs-vhvg8z.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-archive-logs-vhvg8z.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-archive-logs-vhvg8z" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
            id          = null
          - permissions = [
              - "READ_ACP",
              - "WRITE",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
        }
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket.main_bucket must be replaced
-/+ resource "aws_s3_bucket" "main_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-marketing-assets-mpn9cb" -> (known after apply)
      ~ bucket                      = "cyb611-marketing-assets-mpn9cb" -> "cyb611-Insecure-misconfigured-mpn9cb" # forces replacement
      ~ bucket_domain_name          = "cyb611-marketing-assets-mpn9cb.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-marketing-assets-mpn9cb.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-marketing-assets-mpn9cb" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::cyb611-marketing-assets-mpn9cb/*"
                      - Sid       = "AllowPublicRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          - "Environment" = "Production" -> null
          ~ "Name"        = "Marketing Assets" -> "Insecure Misconfigured"
        }
      ~ tags_all                    = {
          - "Environment" = "Production" -> null
          ~ "Name"        = "Marketing Assets" -> "Insecure Misconfigured"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)
      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "HEAD",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [
              - "ETag",
            ] -> null
          - max_age_seconds = 3000 -> null
        }

      ~ grant (known after apply)
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket.public_assets must be replaced
-/+ resource "aws_s3_bucket" "public_assets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-website-assets-8p8ia2" -> (known after apply)
      ~ bucket                      = "cyb611-website-assets-8p8ia2" -> "cyb611-Insecure-public-rw-8p8ia2" # forces replacement
      ~ bucket_domain_name          = "cyb611-website-assets-8p8ia2.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-website-assets-8p8ia2.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-website-assets-8p8ia2" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:PutObjectAcl",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::cyb611-website-assets-8p8ia2/*"
                      - Sid       = "PublicReadWrite"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          - "Environment" = "Production" -> null
          ~ "Name"        = "Public Web Assets" -> "Insecure Public RW"
        }
      ~ tags_all                    = {
          - "Environment" = "Production" -> null
          ~ "Name"        = "Public Web Assets" -> "Insecure Public RW"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)
      - logging {
          - target_bucket = "cyb611-web-logs-8p8ia2" -> null
          - target_prefix = "log/" -> null
        }

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket.public_logs must be replaced
-/+ resource "aws_s3_bucket" "public_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-web-logs-8p8ia2" -> (known after apply)
      ~ bucket                      = "cyb611-web-logs-8p8ia2" -> "cyb611-Insecure-public-rw-logs-8p8ia2" # forces replacement
      ~ bucket_domain_name          = "cyb611-web-logs-8p8ia2.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-web-logs-8p8ia2.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-web-logs-8p8ia2" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
            id          = null
          - permissions = [
              - "READ_ACP",
              - "WRITE",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
        }
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket.secure_storage must be replaced
-/+ resource "aws_s3_bucket" "secure_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cyb611-finance-backup-9r3207" -> (known after apply)
      ~ bucket                      = "cyb611-finance-backup-9r3207" -> "cyb611-Secure-9r3207" # forces replacement
      ~ bucket_domain_name          = "cyb611-finance-backup-9r3207.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cyb611-finance-backup-9r3207.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "cyb611-finance-backup-9r3207" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cyb611-finance-backup-9r3207",
                          - "arn:aws:s3:::cyb611-finance-backup-9r3207/*",
                        ]
                      - Sid       = "DenyHttp"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          - "Environment" = "Production" -> null
          ~ "Name"        = "Finance Backup" -> "Secure Baseline"
        }
      ~ tags_all                    = {
          - "Environment" = "Production" -> null
          ~ "Name"        = "Finance Backup" -> "Secure Baseline"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)
      - logging {
          - target_bucket = "cyb611-internal-logs-9r3207" -> null
          - target_prefix = "log/" -> null
        }

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket_acl.bucket_acl will be created
  + resource "aws_s3_bucket_acl" "bucket_acl" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_acl.dev_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "dev_acl" {
      ~ bucket                = "cyb611-dev-scratchpad-vzt27m" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-dev-scratchpad-vzt27m,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_acl.legacy_log_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "legacy_log_acl" {
      ~ bucket                = "cyb611-archive-logs-vhvg8z" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-archive-logs-vhvg8z,log-delivery-write" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "READ_ACP" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "WRITE" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_acl.log_acl will be created
  + resource "aws_s3_bucket_acl" "log_acl" {
      + acl    = "log-delivery-write"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_acl.public_log_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "public_log_acl" {
      ~ bucket                = "cyb611-web-logs-8p8ia2" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-web-logs-8p8ia2,log-delivery-write" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "READ_ACP" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "WRITE" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_cors_configuration.cors_config must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "cors_config" {
      ~ bucket                = "cyb611-marketing-assets-mpn9cb" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-marketing-assets-mpn9cb" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_logging.legacy_logging_config must be replaced
-/+ resource "aws_s3_bucket_logging" "legacy_logging_config" {
      ~ bucket                = "cyb611-legacy-archive-vhvg8z" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-legacy-archive-vhvg8z" -> (known after apply)
      ~ target_bucket         = "cyb611-archive-logs-vhvg8z" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_logging.log_config must be replaced
-/+ resource "aws_s3_bucket_logging" "log_config" {
      ~ bucket                = "cyb611-finance-backup-9r3207" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-finance-backup-9r3207" -> (known after apply)
      ~ target_bucket         = "cyb611-internal-logs-9r3207" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_logging.public_logging_config must be replaced
-/+ resource "aws_s3_bucket_logging" "public_logging_config" {
      ~ bucket                = "cyb611-website-assets-8p8ia2" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-website-assets-8p8ia2" -> (known after apply)
      ~ target_bucket         = "cyb611-web-logs-8p8ia2" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_ownership_controls.dev_ownership must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "dev_ownership" {
      ~ bucket = "cyb611-dev-scratchpad-vzt27m" -> (known after apply) # forces replacement
      ~ id     = "cyb611-dev-scratchpad-vzt27m" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_ownership_controls.legacy_log_ownership must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "legacy_log_ownership" {
      ~ bucket = "cyb611-archive-logs-vhvg8z" -> (known after apply) # forces replacement
      ~ id     = "cyb611-archive-logs-vhvg8z" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_ownership_controls.legacy_ownership must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "legacy_ownership" {
      ~ bucket = "cyb611-legacy-archive-vhvg8z" -> (known after apply) # forces replacement
      ~ id     = "cyb611-legacy-archive-vhvg8z" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_ownership_controls.log_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "log_ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.public_log_ownership must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "public_log_ownership" {
      ~ bucket = "cyb611-web-logs-8p8ia2" -> (known after apply) # forces replacement
      ~ id     = "cyb611-web-logs-8p8ia2" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_ownership_controls.public_ownership must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "public_ownership" {
      ~ bucket = "cyb611-website-assets-8p8ia2" -> (known after apply) # forces replacement
      ~ id     = "cyb611-website-assets-8p8ia2" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_ownership_controls.secure_ownership must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "secure_ownership" {
      ~ bucket = "cyb611-finance-backup-9r3207" -> (known after apply) # forces replacement
      ~ id     = "cyb611-finance-backup-9r3207" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_policy.dev_policy will be created
  + resource "aws_s3_bucket_policy" "dev_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_policy.enforce_ssl must be replaced
-/+ resource "aws_s3_bucket_policy" "enforce_ssl" {
      ~ bucket = "cyb611-finance-backup-9r3207" -> (known after apply) # forces replacement
      ~ id     = "cyb611-finance-backup-9r3207" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cyb611-finance-backup-9r3207",
                          - "arn:aws:s3:::cyb611-finance-backup-9r3207/*",
                        ]
                      - Sid       = "DenyHttp"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_policy.enforce_tls_public must be replaced
-/+ resource "aws_s3_bucket_policy" "enforce_tls_public" {
      ~ bucket = "cyb611-website-assets-8p8ia2" -> (known after apply) # forces replacement
      ~ id     = "cyb611-website-assets-8p8ia2" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:PutObjectAcl",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::cyb611-website-assets-8p8ia2/*"
                      - Sid       = "PublicReadWrite"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_policy.public_rw_policy must be replaced
-/+ resource "aws_s3_bucket_policy" "public_rw_policy" {
      ~ bucket = "cyb611-website-assets-8p8ia2" -> (known after apply) # forces replacement
      ~ id     = "cyb611-website-assets-8p8ia2" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:PutObjectAcl",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::cyb611-website-assets-8p8ia2/*"
                      - Sid       = "PublicReadWrite"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_policy.read_policy must be replaced
-/+ resource "aws_s3_bucket_policy" "read_policy" {
      ~ bucket = "cyb611-marketing-assets-mpn9cb" -> (known after apply) # forces replacement
      ~ id     = "cyb611-marketing-assets-mpn9cb" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::cyb611-marketing-assets-mpn9cb/*"
                      - Sid       = "AllowPublicRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_public_access_block.block_public must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "block_public" {
      ~ bucket                  = "cyb611-finance-backup-9r3207" -> (known after apply) # forces replacement
      ~ id                      = "cyb611-finance-backup-9r3207" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.dev_unsafe will be created
  + resource "aws_s3_bucket_public_access_block" "dev_unsafe" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_public_access_block.legacy_block must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "legacy_block" {
      ~ bucket                  = "cyb611-legacy-archive-vhvg8z" -> (known after apply) # forces replacement
      ~ id                      = "cyb611-legacy-archive-vhvg8z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.log_block must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "log_block" {
      ~ bucket                  = "cyb611-archive-logs-vhvg8z" -> (known after apply) # forces replacement
      ~ id                      = "cyb611-archive-logs-vhvg8z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.public_access must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "public_access" {
      ~ bucket                  = "cyb611-marketing-assets-mpn9cb" -> (known after apply) # forces replacement
      ~ id                      = "cyb611-marketing-assets-mpn9cb" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.public_block must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "public_block" {
      ~ bucket                  = "cyb611-website-assets-8p8ia2" -> (known after apply) # forces replacement
      ~ id                      = "cyb611-website-assets-8p8ia2" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.default_enc must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "default_enc" {
      ~ bucket                = "cyb611-finance-backup-9r3207" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-finance-backup-9r3207" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.public_enc must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "public_enc" {
      ~ bucket                = "cyb611-website-assets-8p8ia2" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-website-assets-8p8ia2" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.dev_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "dev_versioning" {
      ~ bucket                = "cyb611-dev-scratchpad-vzt27m" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-dev-scratchpad-vzt27m" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_versioning.legacy_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "legacy_versioning" {
      ~ bucket                = "cyb611-legacy-archive-vhvg8z" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-legacy-archive-vhvg8z" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_versioning.public_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "public_versioning" {
      ~ bucket                = "cyb611-website-assets-8p8ia2" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-website-assets-8p8ia2" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_versioning.secure_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "secure_versioning" {
      ~ bucket                = "cyb611-finance-backup-9r3207" -> (known after apply) # forces replacement
      ~ id                    = "cyb611-finance-backup-9r3207" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_versioning.versioning will be created
  + resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

  # aws_s3_object.archive_file must be replaced
-/+ resource "aws_s3_object" "archive_file" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::cyb611-legacy-archive-vhvg8z/sensitive_data/mock_pii.csv" -> (known after apply)
      ~ bucket                        = "cyb611-legacy-archive-vhvg8z" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ etag                          = "19ac515d5851eb0b2a0c38b6bd56a953" -> (known after apply)
      ~ id                            = "sensitive_data/mock_pii.csv" -> (known after apply)
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      ~ version_id                    = "null" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.dataset_upload must be replaced
-/+ resource "aws_s3_object" "dataset_upload" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::cyb611-marketing-assets-mpn9cb/sensitive_data/mock_pii.csv" -> (known after apply)
      ~ bucket                        = "cyb611-marketing-assets-mpn9cb" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ etag                          = "414ecdfa7ab23ec470680a3d8b30bd73" -> (known after apply)
      ~ id                            = "sensitive_data/mock_pii.csv" -> (known after apply)
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.initial_config must be replaced
-/+ resource "aws_s3_object" "initial_config" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::cyb611-dev-scratchpad-vzt27m/sensitive_data/mock_pii.csv" -> (known after apply)
      ~ bucket                        = "cyb611-dev-scratchpad-vzt27m" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ etag                          = "1fcc855d90d2824f99e15fff189456cd" -> (known after apply)
      ~ id                            = "sensitive_data/mock_pii.csv" -> (known after apply)
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      ~ version_id                    = "null" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.sample_record must be replaced
-/+ resource "aws_s3_object" "sample_record" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::cyb611-finance-backup-9r3207/sensitive_data/mock_pii.csv" -> (known after apply)
      ~ bucket                        = "cyb611-finance-backup-9r3207" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ etag                          = "c5d362f49247ccfa2f57392e580e2d23" -> (known after apply)
      ~ id                            = "sensitive_data/mock_pii.csv" -> (known after apply)
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      ~ version_id                    = "null" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.web_asset must be replaced
-/+ resource "aws_s3_object" "web_asset" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::cyb611-website-assets-8p8ia2/sensitive_data/mock_pii.csv" -> (known after apply)
      ~ bucket                        = "cyb611-website-assets-8p8ia2" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ etag                          = "b81a2d403dd01b224f6068e6c7efee1a" -> (known after apply)
      ~ id                            = "sensitive_data/mock_pii.csv" -> (known after apply)
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      ~ version_id                    = "ef9S5.yC8BlM3pYj4YauHLWr4P3cDoEF" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 48 to add, 0 to change, 41 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```